Yourcomputermaster/src/Documents/ВКМ_ФормированиеОсновныхНачислений/ВКМ_ФормированиеОсновныхНачислений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ФормированиеОсновныхНачислений</name>
  <registerRecords>CalculationRegister.ВКМ_ОсновоныеНачисления</registerRecords>
  <registerRecords>CalculationRegister.ВКМ_Удержания</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВзаиморасчетыССотрудниками</registerRecords>
  <tabularSections>
    <name>Сотрудники</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.ВКМ_ПодразделенияСотрудников</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипНачисления</name>
      <type>
        <types>ChartOfCalculationTypesRef.ВКМ_ОсновныеНачисления</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГрафикРабот</name>
      <type>
        <types>EnumRef.ВКМ_ГрафикРабот</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Yourcomputermaster/src/CalculationRegisters/ВКМ_ОсновоныеНачисления/ВКМ_ОсновоныеНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>ВКМ_ОсновоныеНачисления</name>
  <periodicity>Month</periodicity>
  <actionPeriod>true</actionPeriod>
  <basePeriod>true</basePeriod>
  <schedule>InformationRegister.ВКМ_ГрафикРабот</schedule>
  <scheduleValue>InformationRegister.ВКМ_ГрафикРабот.Resource.Значение</scheduleValue>
  <scheduleDate>InformationRegister.ВКМ_ГрафикРабот.Dimension.Дата</scheduleDate>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ВКМ_ОсновныеНачисления</chartOfCalculationTypes>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Ставка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГрафикРабот</name>
    <type>
      <types>EnumRef.ВКМ_ГрафикРабот</types>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ВКМ_ПодразделенияСотрудников</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

Yourcomputermaster/src/InformationRegisters/ВКМ_УсловияОплатыСотрудников/ВКМ_УсловияОплатыСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_УсловияОплатыСотрудников</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>Оклад</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроцентОтРабот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ВКМ_ПодразделенияСотрудников</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Yourcomputermaster/src/AccumulationRegisters/ВКМ_ВыполненныеСотрудникомРаботы/ВКМ_ВыполненныеСотрудникомРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеСотрудникомРаботы</name>
  <resources>
    <name>ЧасовКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаПроведенияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Yourcomputermaster/src/CalculationRegisters/ВКМ_Удержания/ВКМ_Удержания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>ВКМ_Удержания</name>
  <periodicity>Month</periodicity>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ВКМ_Удержания</chartOfCalculationTypes>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Начисление</name>
    <type>
      <types>EnumRef.ВКМ_СпособРасчета</types>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ВКМ_ПодразделенияСотрудников</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

Yourcomputermaster/src/AccumulationRegisters/ВКМ_ВзаиморасчетыССотрудниками/ВКМ_ВзаиморасчетыССотрудниками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВзаиморасчетыССотрудниками</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ВКМ_ПодразделенияСотрудников</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Yourcomputermaster/src/InformationRegisters/ВКМ_ГрафикРабот/ВКМ_ГрафикРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_ГрафикРабот</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ГрафикРабот</name>
    <type>
      <types>EnumRef.ВКМ_ГрафикРабот</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Yourcomputermaster/src/Enums/ВКМ_СпособРасчета/ВКМ_СпособРасчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВКМ_СпособРасчета</name>
  <enumValues>
    <name>Оклад</name>
  </enumValues>
  <enumValues>
    <name>Премия</name>
  </enumValues>
  <enumValues>
    <name>Отпуск</name>
  </enumValues>
</mdclass:Enum>

Yourcomputermaster/src/ChartsOfCalculationTypes/ВКМ_ОсновныеНачисления/ВКМ_ОсновныеНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCalculationTypes>
  <name>ВКМ_ОсновныеНачисления</name>
  <baseCalculationTypes>ChartOfCalculationTypes.ВКМ_ОсновныеНачисления</baseCalculationTypes>
  <baseCalculationTypes>ChartOfCalculationTypes.ВКМ_ДополнительныеНачисления</baseCalculationTypes>
  <predefined>
    <items>
      <name>Оклад</name>
      <description>Оклад</description>
    </items>
    <items>
      <name>Отпуск</name>
      <description>Отпуск</description>
    </items>
  </predefined>
  <attributes>
    <name>СпособРасчета</name>
    <type>
      <types>EnumRef.ВКМ_СпособРасчета</types>
    </type>
  </attributes>
</mdclass:ChartOfCalculationTypes>

Yourcomputermaster/src/Documents/ВКМ_ФормированиеОсновныхНачислений/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий
Процедура ОбработкаПроведения(Отказ, Режим)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	СформироватьДвижения();
	
	РассчитатьНачисления();
	
	РассчитатьНачисленияОтпусков();
	
	ПроведениеВзаиморасчетов();
	
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Процедура СформироватьДвижения();
	
	Для Каждого Строка Из Сотрудники Цикл
		Движение = Движения.ВКМ_ОсновоныеНачисления.Добавить();
		Движение.ПериодРегистрации = Дата;
		Движение.ВидРасчета = Строка.ТипНачисления;
		Движение.ПериодДействияНачало = Строка.ДатаНачала;
		Движение.ПериодДействияКонец = КонецДня(Строка.ДатаОкончания);
		ДВижение.Сотрудник = Строка.Сотрудник;
		Движение.Подразделение = Строка.Подразделение;
		Если Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Оклад Тогда
			Если Движение.Подразделение = Справочники.ВКМ_ПодразделенияСотрудников.Специалист Тогда
				Движение.Ставка = РегистрыСведений.ВКМ_УсловияОплатыСотрудников.ОкладСотрудника(Строка.Сотрудник, Движение.Подразделение, Строка.ДатаНачала) + 
					РегистрыНакопления.ВКМ_ВыполненныеСотрудникомРаботы.ВыполненныеСотрудникомРаботы(Строка.Сотрудник, СТрока.ДатаНачала, СТрока.ДатаОкончания);
			Иначе
				Движение.Ставка = РегистрыСведений.ВКМ_УсловияОплатыСотрудников.ОкладСотрудника(Строка.Сотрудник, Движение.Подразделение, Строка.ДатаНачала);
			КонецЕсли;
		КонецЕсли;
		
		Движение.ГрафикРабот = Строка.ГрафикРабот;
		
		Если Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск Тогда
			
			НачалоБаза = НачалоМесяца(ДобавитьМесяц(Строка.ДатаНачала, -12));
			КонецБаза = НачалоМесяца(Строка.ДатаНачала) - 1;
			Движение.БазовыйПериодНачало = НачалоБаза;
			Движение.БазовыйПериодКонец = КонецБаза;
			
		КонецЕсли;
		
	КонецЦикла;
	Движения.ВКМ_ОсновоныеНачисления.Записать();
КонецПроцедуры

Процедура РассчитатьНачисления()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВКМ_ОсновоныеНачисленияДанныеГрафика.НомерСтроки КАК НомерСтроки,
	               |	ВКМ_ОсновоныеНачисленияДанныеГрафика.ЗначениеФактическийПериодДействия КАК ЗначениеФактическийПериодДействия,
	               |	ВКМ_ОсновоныеНачисленияДанныеГрафика.ЗначениеПериодДействия КАК ЗначениеПериодДействия,
	               |	ВКМ_ОсновоныеНачисленияДанныеГрафика.Ставка КАК Ставка,
	               |	ВКМ_ОсновоныеНачисленияДанныеГрафика.Подразделение КАК Подразделение
	               |ИЗ
	               |	РегистрРасчета.ВКМ_ОсновоныеНачисления.ДанныеГрафика(
	               |			Регистратор = &Регистратор
	               |				И ВидРасчета = &Оклад) КАК ВКМ_ОсновоныеНачисленияДанныеГрафика";
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	Запрос.УстановитьПараметр("Оклад", ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Оклад);
	Результат = Запрос.Выполнить().Выбрать();
	
	Пока Результат.Следующий() Цикл
		Движение = Движения.ВКМ_ОсновоныеНачисления[Результат.НомерСтроки - 1];
		Движение.Сумма = Результат.Ставка / Результат.ЗначениеПериодДействия * Результат.ЗначениеФактическийПериодДействия / 100 * 87;
		ЗаписьУдержаний(Движение.Сотрудник, Движение.Ставка - Движение.Сумма,
			Перечисления.ВКМ_СпособРасчета.Оклад, Результат.Подразделение);
	КонецЦикла;
	
	Движения.ВКМ_ОсновоныеНачисления.Записать(, Истина);
	
КонецПроцедуры

Процедура ЗаписьУдержаний(Сотрудник, Удержание, СпособРасчета, Подразделение) Экспорт
	
	Движения.ВКМ_Удержания.Записывать = Истина;
	ДВижения.ВКМ_Удержания.Записать();
	
	Движение = Движения.ВКМ_Удержания.Добавить();
	Движение.ПериодРегистрации = Дата;
	Движение.Сотрудник = Сотрудник;
	Движение.Подразделение = Подразделение;
	Движение.Начисление = СпособРасчета;
	Движение.Сумма = Удержание;
	Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
	Движения.ВКМ_Удержания.Записать();
	
КонецПроцедуры

Процедура ПроведениеВзаиморасчетов()
	
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВКМ_ОсновоныеНачисления.Сумма КАК Сумма,
	               |	ВКМ_ОсновоныеНачисления.Сотрудник КАК Сотрудник,
	               |	ВКМ_ОсновоныеНачисления.Подразделение КАК Подразделение
	               |ИЗ
	               |	РегистрРасчета.ВКМ_ОсновоныеНачисления КАК ВКМ_ОсновоныеНачисления
	               |ГДЕ
	               |	ВКМ_ОсновоныеНачисления.Регистратор = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Пока Результат.Следующий() Цикл
		Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.ДобавитьПриход();
		Движение.Сотрудник = Результат.Сотрудник;
		ДВижение.Подразделение = Результат.Подразделение;
		Движение.Сумма = РЕзультат.Сумма;
		Движение.Период = Дата;
	КОнецЦикла;
	
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записать();
	
КонецПроцедуры

Процедура РассчитатьНачисленияОтпусков()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВКМ_ОсновоныеНачисленияБазаВКМ_ОсновоныеНачисления.ПериодДействияНачало КАК ПериодДействияНачало,
	               |	ВКМ_ОсновоныеНачисленияБазаВКМ_ОсновоныеНачисления.ПериодДействияКонец КАК ПериодДействияКонец,
	               |	ВКМ_ОсновоныеНачисленияБазаВКМ_ОсновоныеНачисления.БазовыйПериодНачало КАК БазовыйПериодНачало,
	               |	ВКМ_ОсновоныеНачисленияБазаВКМ_ОсновоныеНачисления.БазовыйПериодКонец КАК БазовыйПериодКонец,
	               |	ВКМ_ОсновоныеНачисленияБазаВКМ_ОсновоныеНачисления.Сотрудник КАК Сотрудник,
	               |	ВКМ_ОсновоныеНачисленияБазаВКМ_ОсновоныеНачисления.Подразделение КАК Подразделение,
	               |	ВКМ_ОсновоныеНачисленияБазаВКМ_ОсновоныеНачисления.Ставка КАК Ставка,
	               |	ВКМ_ОсновоныеНачисленияБазаВКМ_ОсновоныеНачисления.ГрафикРабот КАК ГрафикРабот,
	               |	ВКМ_ОсновоныеНачисленияБазаВКМ_ОсновоныеНачисления.СуммаБаза КАК СуммаБаза,
	               |	ВКМ_ОсновоныеНачисленияБазаВКМ_ОсновоныеНачисления.НомерСтроки КАК НомерСтроки
	               |ПОМЕСТИТЬ ВТ_База
	               |ИЗ
	               |	РегистрРасчета.ВКМ_ОсновоныеНачисления.БазаВКМ_ОсновоныеНачисления(
	               |			&Измерения,
	               |			&Измерения,
	               |			,
	               |			Регистратор = &Ссылка
	               |				И ВидРасчета = &Отпуск) КАК ВКМ_ОсновоныеНачисленияБазаВКМ_ОсновоныеНачисления
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_База.ПериодДействияНачало КАК ПериодДействияНачало,
	               |	ВТ_База.ПериодДействияКонец КАК ПериодДействияКонец,
	               |	ВТ_База.БазовыйПериодНачало КАК БазовыйПериодНачало,
	               |	ВТ_База.БазовыйПериодКонец КАК БазовыйПериодКонец,
	               |	ВТ_База.Сотрудник КАК Сотрудник,
	               |	ВТ_База.Подразделение КАК Подразделение,
	               |	ВТ_База.Ставка КАК Ставка,
	               |	ВТ_База.ГрафикРабот КАК ГрафикРабот,
	               |	ВТ_База.СуммаБаза КАК Сумма,
	               |	СУММА(ВКМ_ГрафикРабот.Значение) КАК РабочихДней,
	               |	РАЗНОСТЬДАТ(ВТ_База.ПериодДействияНачало, ВТ_База.ПериодДействияКонец, ДЕНЬ) + 1 КАК ДнейОтпуска,
	               |	ВТ_База.НомерСтроки КАК НомерСтроки
	               |ИЗ
	               |	ВТ_База КАК ВТ_База
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВКМ_ГрафикРабот КАК ВКМ_ГрафикРабот
	               |		ПО ВТ_База.ГрафикРабот = ВКМ_ГрафикРабот.ГрафикРабот
	               |			И (ВКМ_ГрафикРабот.Дата МЕЖДУ ВТ_База.БазовыйПериодНачало И ВТ_База.БазовыйПериодКонец)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_База.ПериодДействияНачало,
	               |	ВТ_База.ПериодДействияКонец,
	               |	ВТ_База.БазовыйПериодНачало,
	               |	ВТ_База.БазовыйПериодКонец,
	               |	ВТ_База.Сотрудник,
	               |	ВТ_База.Подразделение,
	               |	ВТ_База.Ставка,
	               |	ВТ_База.ГрафикРабот,
	               |	ВТ_База.СуммаБаза,
	               |	ВТ_База.НомерСтроки";
	
	Измерения = Новый Массив;
	Измерения.Добавить("Сотрудник");
	Измерения.Добавить("Подразделение");
	
	Запрос.УстановитьПараметр("Измерения", Измерения);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Отпуск", ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск);
	//Запрос.ВыполнитьПакет()
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Количество() > 0 Тогда
		Пока Результат.Следующий() Цикл
			Движение = Движения.ВКМ_ОсновоныеНачисления[Результат.НомерСтроки - 1];
			ДоНДФЛ = Результат.Сумма / Результат.РабочихДней * Результат.ДнейОтпуска;
			ПослеНДФЛ = ДоНДФЛ / 100 * 87;
			Движение.Сумма = ПослеНДФЛ;
			ЗаписьУдержаний(Движение.Сотрудник, ДоНДФЛ - ПослеНДФЛ, Перечисления.ВКМ_СпособРасчета.Отпуск, Результат.Подразделение);
		КонецЦикла;;
	КонецЕсли;
	
	Движения.ВКМ_ОсновоныеНачисления.Записать(, Истина);
	
КонецПроцедуры


#КонецОбласти

#КонецЕсли
